# グラフの探索（深さ優先探索）

N = 8 # 点の数

a = [
    [0,0,0,0,0,0,0,0,0],
    [0,0,1,0,0,0,0,0,0],
    [0,1,0,1,1,0,0,0,0],
    [0,0,1,0,0,0,0,1,0],
    [0,0,1,0,0,1,0,0,0],
    [0,0,0,0,1,0,1,0,0],
    [0,0,0,0,0,1,0,1,1],
    [0,0,0,1,0,0,1,0,1],
    [0,0,0,0,0,0,1,1,0]
]

v = [0 for i in range(N+1)] # 訪問フラグ

def visit(i):
    v[i] = 1 # 訪問したことをチェック
    for j in range(1,N+1):
        if a[i][j]==1 and v[j]==0:
            print("%d->%d   "%(i,j), end="")
            visit(j)

def main():
    # 各ノードを始点としたグラフ探索
    for k in range(1,N+1):
        print("ノード%dを始点とする： "%(k),end="")
        for i in range(1,N+1): # 一度フラグをクリアにする
            v[i]=0
        visit(k)
        print("")

if __name__=="__main__":
    main()
